{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping two UI text-removal features to affected frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the roles of various frontend components, pages, and utilities.",
  "frontend/index.css": "Global CSS variables and Tailwind base styles defining color themes, dark mode, and layout defaults.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main app component orchestrating page transitions and wrapping content in music and flow providers.",
  "frontend/src/components/audio/MusicProvider.tsx": "Context provider that loads a looping audio file and exposes play/pause state and controls.",
  "frontend/src/components/audio/MusicToggle.tsx": "Floating button that toggles background music and switches icons based on playback state.",
  "frontend/src/components/controls/BackToLandingButton.tsx": "Back button component that calls goToLanding and uses a styled RomanticButton.",
  "frontend/src/components/controls/RomanticButton.tsx": "Wrapper around a UI button adding gradient romantic styling and size options.",
  "frontend/src/components/effects/CursorPetalTrail.tsx": "Canvas effect drawing animated falling petals that follow cursor movement unless on touch or reduced-motion.",
  "frontend/src/components/effects/FallingFlowersBackground.tsx": "Canvas animation generating drifting flower petals (rose/tulip) with adjustable variant and speed.",
  "frontend/src/components/effects/FloatingHearts.tsx": "Generates floating heart emoji elements with randomized animation inside a non-interactive container.",
  "frontend/src/components/effects/SparklesOverlay.tsx": "Canvas overlay drawing twinkling sparkles that animate opacity over time.",
  "frontend/src/components/forms/RiddleCard.tsx": "Displays a riddle with an input field, error message, and submit button, with shake animation on wrong answers.",
  "frontend/src/components/media/SessionImageUpload.tsx": "Allows users to upload an image, preview it, and triggers file selection via a styled button.",
  "frontend/src/components/note/HandwrittenNoteCard.tsx": "Shows a handwritten-style note inside a styled card container.",
  "frontend/src/components/typography/FloralTitle.tsx": "Renders a large gradient-animated title with a floral bounce effect.",
  "frontend/src/content/strings.ts": "Provides static text strings for landing, riddle, intermediate, and final steps.",
  "frontend/src/flow/FlowProvider.tsx": "Manages app flow state, attempts, and uploaded photos using context and sessionStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refetching queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity login, state persistence, and exposes identity context.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating backend has no methods.",
  "frontend/src/index.css": "Defines global styles, fonts, Tailwind layers, and UI animations like shake and floral bounce.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/FinalPage.tsx": "Shows the final note, heart effects, and lets the user upload a final photo.",
  "frontend/src/pages/IntermediatePage.tsx": "Displays a message with a button to proceed to the final step.",
  "frontend/src/pages/LandingPage.tsx": "Shows animated landing screen with title, subtitle, and button to start the riddle flow.",
  "frontend/src/pages/RiddlePage.tsx": "Renders the riddle input flow, handling attempts, error animations, and navigation on success or failure.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom pastel-themed colors, fonts, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, goals, design requirements, flow structure, and existing features for a romantic multi-page web experience."
}