{
  "backend/main.mo": "Defines an empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Contains feature evidence metadata listing feature IDs, associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files describing their roles in the app’s flow, pages, effects, components, and styling.",
  "frontend/index.css": "Defines global CSS variables, light/dark theme tokens, and base Tailwind-applied styles for the application.",
  "frontend/index.html": "Base HTML template that mounts the React app and loads main.tsx as the entry script.",
  "frontend/src/App.tsx": "Root React component handling page transitions and wrapping the app with MusicProvider and FlowProvider.",
  "frontend/src/components/audio/MusicProvider.tsx": "Implements a React context that manages background audio playback with toggle control and lifecycle cleanup.",
  "frontend/src/components/audio/MusicToggle.tsx": "Provides a floating button that toggles background music and visually reflects play state.",
  "frontend/src/components/controls/BackToLandingButton.tsx": "Renders a fixed-position button that triggers returning to the landing page via flow context.",
  "frontend/src/components/controls/RomanticButton.tsx": "Styled wrapper around the UI Button component applying gradient romantic-themed visuals and animations.",
  "frontend/src/components/effects/CursorPetalTrail.tsx": "Canvas effect that spawns and animates falling petals following mouse movement, disabled on touch or reduced-motion devices.",
  "frontend/src/components/effects/FallingFlowersBackground.tsx": "Canvas background drawing continuously falling rose or tulip petals with configurable variant and speed.",
  "frontend/src/components/effects/FloatingHearts.tsx": "Creates floating animated heart emoji elements positioned randomly inside a container.",
  "frontend/src/components/effects/SparklesOverlay.tsx": "Canvas overlay rendering subtle twinkling sparkles that animate opacity for a shimmer effect.",
  "frontend/src/components/forms/RiddleCard.tsx": "Card component showing a riddle with an input, error display, and submit button with shake animation.",
  "frontend/src/components/media/SessionImageUpload.tsx": "Lets users upload an image via hidden file input and previews it in a styled square button.",
  "frontend/src/components/note/HandwrittenNoteCard.tsx": "Displays a handwritten-style note inside a styled card.",
  "frontend/src/components/typography/FloralTitle.tsx": "Large gradient-animated title text component with decorative styling.",
  "frontend/src/content/strings.ts": "Contains all static text strings for landing, riddle, intermediate, and final pages.",
  "frontend/src/flow/FlowProvider.tsx": "Manages app flow state, attempts, and uploaded photos with sessionStorage persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, clear, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Empty module noting no backend queries are used.",
  "frontend/src/index.css": "Global styles, fonts, Tailwind layers, and custom animations for UI effects.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering App.",
  "frontend/src/pages/FinalPage.tsx": "Final page showing a note and allowing the user to upload a final photo with decorative effects.",
  "frontend/src/pages/IntermediatePage.tsx": "Intermediate message page guiding user to continue to the final step.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with animated floral title, subtitle, and button to start the riddle flow.",
  "frontend/src/pages/RiddlePage.tsx": "Riddle page handling answer logic, attempts, and transitions to final or intermediate steps.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom fonts, OKLCH-based color variables, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a romantic multi-page flow, aesthetic guidelines, animations, and notes on image handling and feature requirements."
}