{
  "kind": "build_request",
  "title": "Remove AI-generated images everywhere except the Final page last photo section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Remove all AI-generated image usage from the UI everywhere except the Final page last section (the \"This is you 🌷\" photo upload/preview section). This includes removing the fixed photos on the Riddle and Intermediate pages and removing any image-based decorative assets used for backgrounds/effects/titles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove all the images instead of the last section which are ai generated"
        ]
      },
      "acceptanceCriteria": [
        "Riddle page no longer renders the fixed image currently sourced from \"/assets/generated/her-photo.dim_1024x1024.png\".",
        "Intermediate page no longer renders the fixed image currently sourced from \"/assets/generated/my-photo.dim_1024x1024.png\".",
        "Landing page title no longer uses the floral texture image currently referenced as \"/assets/generated/floral-texture-seamless.dim_1024x1024.png\".",
        "Falling flower background animation no longer loads or depends on \"/assets/generated/rose-petal-sprite.dim_256x256.png\" or \"/assets/generated/tulip-petal-sprite.dim_256x256.png\".",
        "Cursor petal trail effect no longer loads or depends on \"/assets/generated/rose-petal-sprite.dim_256x256.png\".",
        "Final page still shows the last section title exactly \"This is you 🌷\" and still allows uploading and previewing a user-selected image via the existing upload component.",
        "No remaining runtime references to \"/assets/generated/\" images exist except those required to support the Final page user-upload preview (data URL) behavior."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Preserve the existing flow, copy, and interactivity while removing AI-generated images: do not change navigation steps, riddle attempt logic, wrong-answer messaging, provided strings, music toggle behavior, or back button behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove all the images instead of the last section which are ai generated"
        ]
      },
      "acceptanceCriteria": [
        "All user-facing strings in frontend/src/content/strings.ts remain exactly unchanged.",
        "Riddle validation remains case-insensitive for the correct answer \"RICHELLE\" and still enforces exactly two attempts with the same wrong-answer message.",
        "Transitions between pages, the music toggle, and the back-to-landing button continue to function as before."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add new AI-generated replacement images.",
    "Do not introduce new pages or change the Landing → Riddle → (Intermediate on fail) → Final flow.",
    "Do not add backend persistence or external storage for images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}